app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "sbaixas@gmail.com"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "sbaixas@gmail.com"], ["LIMIT", 1]]
---
	def create
		if User.exists?(:email => session_params[:email])