app/controllers/users_controller.rb

INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    	user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "sbaixas@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_name", "Boixas"], ["updated_at", "2018-04-17 23:25:12.966476"], ["id", 4]]
---
  def update
    	user = User.find_by_email(user_params[:email])
	user.assign_attributes(user_params)
	if user.valid?
		user.save